{
  "carts": [
    {
      "email": "Hedn",
      "cartProducts": [],
      "id": 1
    },
    {
      "email": "Hedn",
      "cartProducts": [
        {
          "name": "Acer Aspire 3 A315-24P-R7VH",
          "price": 329.99,
          "url": "https://m.media-amazon.com/images/I/71+1lOl1Y1L._AC_SX355_.jpg",
          "quantity": 3
        }
      ],
      "id": 2
    },
    {
      "email": "ddd",
      "cartProducts": [
        {
          "name": "Logitech 981-000536 G430 7.1",
          "price": 184.99,
          "url": "https://m.media-amazon.com/images/I/81xlboCOT9L._AC_SY355_.jpg",
          "quantity": 1
        },
        {
          "name": "Logitech K480 Wireless Multi-Device",
          "price": 34.99,
          "url": "https://m.media-amazon.com/images/I/61fl+k9O-FL._AC_SY355_.jpg",
          "quantity": 1
        }
      ],
      "id": 3
    },
    {
      "email": "fff",
      "cartProducts": [
        {
          "name": "Logitech K480 Wireless Multi-Device",
          "price": 34.99,
          "url": "https://m.media-amazon.com/images/I/61fl+k9O-FL._AC_SY355_.jpg",
          "quantity": 1
        },
        {
          "name": "2022 HP Pavilion 17",
          "price": 628.99,
          "url": "https://m.media-amazon.com/images/I/61gPlWZqHIL._AC_SX450_.jpg",
          "quantity": 1
        }
      ],
      "id": 4
    },
    {
      "email": "he",
      "cartProducts": [
        {
          "name": "Amazon Basics Low-Profile Wired",
          "price": 11.99,
          "url": "https://m.media-amazon.com/images/I/81cg9myC9kL._AC_SY450_.jpg",
          "quantity": 1
        },
        {
          "name": "Lenovo 3i Chromebook -",
          "price": 299.99,
          "url": "https://m.media-amazon.com/images/I/51pwqs5xEcL._AC_SX355_.jpg",
          "quantity": 1
        },
        {
          "name": "SAMSUNG Galaxy S22 Ultra",
          "price": 799.99,
          "url": "https://m.media-amazon.com/images/I/61nhOdlKpDL._AC_SX355_.jpg",
          "quantity": 1
        },
        {
          "name": "Apple iPhone 11, 64GB,",
          "price": 309.99,
          "url": "https://m.media-amazon.com/images/I/612kg3rGyYL._AC_SX522_.jpg",
          "quantity": 1
        }
      ],
      "id": 5
    },
    {
      "email": "ffff",
      "cartProducts": [
        {
          "name": "Lenovo 3i Chromebook -",
          "price": 299.99,
          "url": "https://m.media-amazon.com/images/I/51pwqs5xEcL._AC_SX355_.jpg",
          "quantity": 1
        },
        {
          "name": "SAMSUNG Galaxy S22 Ultra",
          "price": 799.99,
          "url": "https://m.media-amazon.com/images/I/61nhOdlKpDL._AC_SX355_.jpg",
          "quantity": 3
        }
      ],
      "id": 6
    }
  ],
  "users": [
    {
      "fullName": "hemdan@gmail.com",
      "email": "hemdan@gmail.com",
      "password": "hemdan@gmail.com",
      "id": 1
    },
    {
      "fullName": "hemdan@gmail.com",
      "email": "hemdan@gmail.com",
      "password": "hemdan@gmail.com",
      "id": 2
    },
    {
      "fullName": "hemdan@gmail",
      "email": "hemdan@gmail",
      "password": "hemdan@gmail",
      "id": 3
    },
    {
      "fullName": "hemdan@gmail",
      "email": "hemdan@gmail",
      "password": "hemdan@gmail",
      "id": 4
    },
    {
      "fullName": "hemdan@gmail",
      "email": "hemdan@gmail",
      "password": "hemdan@gmail",
      "id": 5
    },
    {
      "fullName": "this.userRegister.value.email@ddd",
      "email": "this.userRegister.value.email@ddd",
      "password": "this.userRegister.value.email@ddd",
      "id": 6
    }
  ],
  "products": [
    {
      "id": 0,
      "name": "SAMSUNG Galaxy S22 Ultra",
      "about": "8K SUPER STEADY VIDEO: Shoot videos that rival how epic your life is with stunning 8K recording, the highest recording resolution available on a smartphone; Video captured is effortlessly smooth, thanks to Auto Focus Video Stabilization on Galaxy S22 Ultra.Form_factor : Smartphone NIGHTOGRAPHY plus PORTAIT MODE: Capture the night with crystal clear, bright pics and videos, no matter the lighting with Night Mode; Portrait Mode auto-detects and adjusts to what you want front and center, making all your photos worthy of a frame 108MP PHOTO RESOLUTION plus BRIGHT DISPLAY: Capture premium detail with 108MP resolution— the highest available on a cell phone; Your favorite content will look even more epic on our brightest display ever with Vision Booster ADAPTIVE COLOR CONTRAST: Streaming on the go, working from your patio or binge-watching late into the night. The Galaxy S22 Ultra adaptive screen automatically optimizes color and brightness, outdoors and indoors LONG LASTING BATTERY plus FAST CHARGING: Power every scroll, click, tap and stream all day long and then some with an intelligent, long-lasting battery; Dive back into action at a moment’s notice with 45W Super-Fast Charging EMBEDDED S PEN: New phone, new S Pen; Now you can unleash your creativity on Galaxy S22 Ultra with an embedded S Pen; Edit photos and videos with pinpoint accuracy, and do it all with that pen-to-paper feel PREMIUM DESIGN & CRAFTMANSHIP: With a classy, eye-catching glass-metal-glass design, we’re setting a standard for smart phones; With our strongest aluminum frame and the latest Gorilla Glass, this phone is lightweight and durable to help endure scratches and dings",
      "url": "https://m.media-amazon.com/images/I/61nhOdlKpDL._AC_SX355_.jpg",
      "category": "phone",
      "price": 799.99,
      "description": {
        "Brand": "SAMSUNG",
        "Model Name": "S22 Ultra",
        "Wireless Carrier": "Unlocked",
        "Operating System": "Android 12.0",
        "Cellular Technology": "5G",
        "Memory Storage Capacity": "128 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi",
        "Color": "Green",
        "Screen Size": "6.8 Inches",
        "Wireless network technology": "GSM, CDMA, LTE"
      }
    },
    {
      "id": 1,
      "name": "Lenovo 3i Chromebook -",
      "about": "Multitask at full power: With Chrome OS, ask Google to help you manage different tasks and stay productive, you can manage device actions, schedule calendar events, set reminders, and more, just say “Ok Google” to get started Made for ease of use: The Lenovo 3i Chromebook was made with an easy-to-flip lid, large touchpad, and an added numpad, you can watch shows with fewer distractions on a 15\" FHD display with narrow bezels for more screen real estate and wider viewing angles Crank up those tunes all day: Stream audio that’s remarkably loud and clear from user-facing stereo speakers Security you can count on: Each time your Chromebook starts up, it goes through a rigorous and seamless security check-up that prevents malware. F ; furthermore, your Chromebook updates every six weeks with the latest protections Made to do more: With up to 10 hours of battery life on a single charge and one USB Type-C ports, two USB 3.0 ports, one HDMI port, as well as one microSD card reader, and one audio combo jack › See more product details",
      "url": "https://m.media-amazon.com/images/I/51pwqs5xEcL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 299.99,
      "description": {
        "Brand": "Lenovo",
        "Series": "IdeaPad 3",
        "Screen Size": "15.6 Inches",
        "Color": "Blue",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Celeron P4500",
        "Ram Memory Installed Size": "8 GB",
        "Operating System": "Chrome OS",
        "Special Feature": "Narrow",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 2,
      "name": "Amazon Basics Low-Profile Wired",
      "about": "Keyboard with low-profile keys for a comfortable, quiet typing experience Includes a matte black keyboard with US layout (QWERTY) and a simple wired USB connection Hotkeys enable easy access to Media, My Computer, Mute, Volume up/down, and Calculator 4 function keys control Previous Track, Stop, Play/Pause, and Next Track on a media player Compatible with Windows 2000, XP, Vista, 7, 8, and 10 Ships in Certified Frustration-Free Packaging Product dimensions: 17.4 x 5 x 1.1 inches (LxWxH)",
      "url": "https://m.media-amazon.com/images/I/81cg9myC9kL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 11.99,
      "description": {
        "Brand": "Amazon Basics",
        "Compatible Devices": "PC",
        "Connectivity Technology": "USB",
        "Keyboard Description": "USB",
        "Recommended Uses For Product": "Office",
        "Special Feature": "Multimedia Keyboard",
        "Color": "Black",
        "Operating System": "Vista,Windows 2000",
        "Number of Keys": "104",
        "Keyboard backlighting color support": "Single Color"
      }
    },
    {
      "id": 3,
      "name": "Logitech G435 LIGHTSPEED and",
      "about": "Total comfort: Breathable fabric earcups keep your ears cool during long play sessions, and the comfortable memory foam padding helps absorb sound waves to improve overall sound Versatile: Logitech G435 is the first headset with LIGHTSPEED wireless and low latency Bluetooth connectivity, providing more freedom of play on PC, smartphones, PlayStation and Nintendo Switch gaming devices Lightweight: With a lightweight construction, this wireless gaming headset weighs only 5.8 oz (165 g), making it comfortable to wear all day long Superior voice quality: Be heard loud and clear thanks to the built-in dual beamforming microphones that eliminate the need for a mic arm and reduce background noise Immersive sound: This cool and colorful headset delivers carefully balanced, high-fidelity audio with 40 mm drivers; compatibility with Dolby Atmos, Windows Sonic for a true surround sound experience Long battery life: No need to stop the game to recharge thanks to G435's 18 hours of battery life, allowing you to keep playing, talking to friends, and listening to music all day More sustainable: The plastic parts are made from a minimum 22% post-consumer recycled plastic, paper packaging comes from FSC-certified forests, G435 is certified CarbonNeutral Safer: An optional max volume limiter at less than 85 decibel can be activated to protect eardrums during extended use",
      "url": "https://m.media-amazon.com/images/I/81WfRjLX93L._AC_SY355_.jpg",
      "category": "headset",
      "price": 47.99,
      "description": {
        "Brand": "Logitech G",
        "Series": "LIGHTSPEED Wireless Gaming Headset",
        "Color": "White",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Bluetooth"
      }
    },
    {
      "id": 4,
      "name": "Logitech Wireless Combo MK270,",
      "about": "The USB receiver is conveniently located in the box, top flap Work for longer with long battery life: Basic AA and AAA batteries are included with the keyboard and mouse Keyboard and mouse combo: The Logitech MK270 Wireless keyboard and mouse combo includes a full size keyboard and a precision mouse so you can work comfortably away from your computer Easy storage: The MK270 includes a plug and forget receiver that cleverly stores inside your mouse for safekeeping. Programmable hotkeys to boost productivity: Automatically access frequently used applications by programming them to the 8 available hotkeys",
      "url": "https://m.media-amazon.com/images/I/61v+taI5jvL._AC_SY450_PIbundle-4,TopRight,0,0_SH20_.jpg",
      "category": "keyboard",
      "price": 119.99,
      "description": {
        "Brand": "Logitech",
        "Color": "Black",
        "Connectivity Technology": "Usb",
        "Compatible Devices": "Personal Computer",
        "Keyboard Description": "Membrane"
      }
    },
    {
      "id": 5,
      "name": "Apple iPhone 11, 64GB,",
      "about": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.). Tested for battery health and guaranteed to have a minimum battery capacity of 80%. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable. Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.",
      "url": "https://m.media-amazon.com/images/I/612kg3rGyYL._AC_SX522_.jpg",
      "category": "phone",
      "price": 309.99,
      "description": {
        "Brand": "Apple",
        "Model Name": "iPhone 11",
        "Wireless Carrier": "Unlocked for All Carriers",
        " OS ": "iOS",
        "Cellular Technology": "5G",
        "Memory Storage Capacity": "64 GB",
        " Connectivity technologies ": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Black",
        "Screen Size": "6.1 Inches",
        "Wireless network technology": "GSM, CDMA"
      }
    },
    {
      "id": 6,
      "name": "Dacoity Gaming Keyboard, 104",
      "about": "🌟【Ergonomic Design with Wrist Rest】This silent keyboard features a scientific stepped keycap design to maximize hand comfort for long hours of gaming or work. It also provides you with an ergonomic typing angle (7°) and wrist support during use. All keys have a soft feel and no loud clicks. It will not affect others when staying up late typing or playing games, it is very suitable for office or games. 🌟【LED Backlit Light Up Keyboard】There are 2 light-up modes and 3 levels of brightness for choice. ☼: Static Backlit/turn off; FN+☼: Dynamic backlight. Fn+PgUp: Adjust the brightness plus; Fn+PgDn: Adjust the brightness reduction. FN+ +/-: Adjust the speed of the dynamic backlight. (Note: the light is not RGB, the light color cannot be changed). 🌟【Durable Metal Panel Keyboard】This rainbow backlit keyboard is designed with an aluminum alloy panel, which not only improves the overall texture of the USB keyboard but also greatly improves the durability and water resistance. The metal frame on the keyboard is also coated with rubber oil, which is skin-friendly and feels more comfortable. At the same time, there are 4 drainage holes at the bottom of the led keyboard, you don't worry about spilled liquids that will damage the computer keyboard. 🌟【Multi-Media & Anti Ghosting】12 multimedia keys for your gaming operation or work efficiency. 19 anti-ghosting keys, every click is never lost, ensuring smooth typing. You can interchange WSAD keys with arrow keys by pressing FN+W and lock/unlock the WIN key by pressing N+WIN. (Note: Multimedia keys are unavailable on Mac) 🌟【Strong Compatibility & Quality Assurance】Constructed with a classic crater structure, this waterproof keyboard can withstand 50 million keystrokes. No matter how long you use it, the laser-engraved letters on the keycaps are durable and never fade. Removable keycaps for quick cleaning without worrying about dust or dirt. It supports Plug & Play and is widely compatible with Windows 95/98/XP/2000/ME/VISTA/7/8/9/10, Mac. 🌟【You are our VIP customer】Dacoity wired keyboard that meets the need of gamers, typists, programmers, and writers, and combines your office and gaming experience. If you have any quality problems, please contact customer service. We offer 180 days refund or replacement and a free-time warranty for the quality problem.",
      "url": "https://m.media-amazon.com/images/I/715XLKbQnFL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 29.99,
      "description": {
        "Brand": "Dacoity",
        "Compatible Devices": "Gaming Console",
        "Connectivity Technology": "USB",
        "Keyboard Description": "Gaming, Membrane, Multimedia",
        "Recommended Uses For Product": "Office, Gaming",
        "Special Feature": "Rainbow LED Backlit, Waterproof, Backlit, Wrist Rest, Slient",
        "Color": "Black",
        "Operating System": "Mac OS 9",
        "Number of Keys": "104",
        "Keyboard backlighting color support": "RGB"
      }
    },
    {
      "id": 7,
      "name": "Amazon Basics Low-Profile Wired",
      "about": "Keyboard with low-profile keys for a comfortable, quiet typing experience Includes a matte black keyboard with US layout (QWERTY) and a simple wired USB connection Hotkeys enable easy access to Media, My Computer, Mute, Volume up/down, and Calculator 4 function keys control Previous Track, Stop, Play/Pause, and Next Track on a media player Compatible with Windows 2000, XP, Vista, 7, 8, and 10 Ships in Certified Frustration-Free Packaging Product dimensions: 17.4 x 5 x 1.1 inches (LxWxH)",
      "url": "https://m.media-amazon.com/images/I/81cg9myC9kL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 11.99,
      "description": {
        "Brand": "Amazon Basics",
        "Compatible Devices": "PC",
        "Connectivity Technology": "USB",
        "Keyboard Description": "USB",
        "Recommended Uses For Product": "Office",
        "Special Feature": "Multimedia Keyboard",
        "Color": "Black",
        "Operating System": "Vista,Windows 2000",
        "Number of Keys": "104",
        "Keyboard backlighting color support": "Single Color"
      }
    },
    {
      "id": 8,
      "name": "SENZER SG500 Surround Sound",
      "about": "[FOLDABLE & DETACHABLE EAR PADS]: Features flexible headphones with telescopic arms and detachable ear pads. The headphones fold inside the arm, making them perfect for easy storage and travelling and the ear pads are magnetic, allowing them to be conveniently attached and removed, making them easier to clean and maintain compared with other headphones. [COMFORTABLE LIGHTWEIGHT DESIGN]: Comfortable for kids and adults alike, the detachable memory foam ear cushions are extremely lightweight, allowing for up to 8 hours usage without excess pressure build up, meaning you won't feel any discomfort even after many hours of gaming. The overall weight is only 0.66lb; approximately 40% lighter than standard gaming headsets. [NOISE CANCELLING ANTI-STATIC MICROPHONE]: The bendable microphone arm can be fixed to any position to ensure the clearest voice pick-up, and filters out surrounding environmental noise and eliminates static. The Senzer SG500 noise cancelling headset with microphone provides real-time in game chat without delay, making it easier to communicate with team-mates, friends and family without unnecessary interruptions. [SURROUND SOUND CAPABLE]: Proven to enhance your gaming performance, this surround sound gaming headset gives you crystal clear audio and provides you a truly immersive video game experience. Pick up the direction of gunfire, vehicles and voices more clearly, as well as enjoying a more enhanced audio experience as subtle sounds like footsteps, wind and rain are projected with more clarity and precision. [PLUG AND PLAY MULTI-PLATFORM COMPATIBILITY]: Works with most modern devices which include a 3.5mm jack like PlayStation 4, Xbox One (Older version requires adaptor), Apple Mac, Laptop, PC & Mobile. No drivers or downloads required, simply Plug & Play, making it the ideal headset for travelling or as a gift, safe in the knowledge it will fit a multitude of devices.",
      "url": "https://m.media-amazon.com/images/I/71EHw68EScL._AC_SY355_.jpg",
      "category": "headset",
      "price": 23.99,
      "description": {
        "Brand": "SENZER",
        "Model Name": "SG500",
        "Color": "Black",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 9,
      "name": "SAMSUNG Galaxy Z Flip",
      "about": "FLEX, POSE, POST: Getting that post-worthy solo shot is easy with a phone that stands on its own; Put Galaxy Z Flip4 in Flex Mode and capture hands-free selfies, record your epic dance moves and never worry about your makeshift tripod falling over again.Form_factor : Flip.Other camera description:Front,Rear CAPTURE ON ONE SCREEN, TEXT ON THE OTHER: Catch up with friends on the top and find the perfect pic to post on the bottom; Flex Mode makes doing two things at once a breeze NEVER MISS A NOTIFICATION: The customizable cover screen on Galaxy Z Flip4 allows you to see just what you need while keeping your full screen private; Respond to texts, skip songs and change settings all while keeping your cellphone conveniently compact PERFECTLY POCKET SIZED: Ditch the bag and travel light; The compact, foldable design lets you say bye to the bulk without sacrificing a big screen; Slide your smart phone easily into even your front pocket UNFOLD A FASHION STATEMENT: Your phone is your most-used accessory, so why not make it an extension of your style, Choose from a wide array of colors and customize your cover screen so your mobile fits your vibe STAY IN SYNC: Stay up to date on notifications or track your workout right on your wrist; Galaxy Z Flip4 easily syncs to your Galaxy Watch, and with an array of color options, you can get one to match your vibe GALAXY Z Flip4 & BUDS ARE BETTER TOGETHER: Pair your Galaxy Z Flip4 with Galaxy Buds and stay up to date on notifications or tune in to your playlists or podcasts on the go; Simply sync your devices and keep your world connected",
      "url": "https://m.media-amazon.com/images/I/51K7abmErwL._AC_SY450_.jpg",
      "category": "phone",
      "price": 1059.99,
      "description": {
        "Brand": "SAMSUNG",
        "Model Name": "Galaxy Z Flip4",
        "Wireless Carrier": "Unlocked",
        "Operating System": "Android 12.0",
        "Cellular Technology": "LTE, GSM, WCDMA, UMTS",
        "Memory Storage Capacity": "256 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Bora Purple",
        "Wireless network technology": "Wi-Fi",
        "Ram Memory Installed Size": "8 GB"
      }
    },
    {
      "id": 10,
      "name": "ASUS Vivobook 14 FHD",
      "about": "【 Latest 12 th Gen Intel Core i3-1215U Processor】 (10M Cache, up to 4.4 GHz, 6 cores) and Intel UHD graphics. The 12th gen 6-Core laptop brings the perfect combination of features to make you unstoppable. This is an ideal home office laptop to get things done fast with high performance, instant responsiveness and best-in-class connectivity. 【14 inch Full HD LED display (1920 x 1080)】Comes with 14 IN FHD (1920 x 1080) with ultra-slim NanoEdge bezels. The 1920 x 1080 resolution boasts impressive color and clarity. Energy-efficient LED backlight With Fingerprint Reader. 【180°Lay-flat Hinge】Wide open for sharing. The 180°Lay-flat hinge makes it so much easier when you want to share stuff with those around you, too. The keyboard board backlit on the Vivo book 14 us perfect for working in dim environments. | 【Fingerprint Sensor】 【Upgrade to 20GB system memory for advanced multitasking】Substantial high-bandwidth RAM to smoothly run your games and photo and video-editing applications, as well as multiple programs and browser tabs all at once. 【Upgrade to 1TB SSD Storage】Boot up in seconds, get to files faster, and have room for loads of files with the lightning-quick solid state drive. Model year : 2023 System ram type : ddr4 sdram › See more product details",
      "url": "https://m.media-amazon.com/images/I/61u6A1ecsiL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "category": "laptop",
      "price": 489.99,
      "description": {
        "Brand": "ASUS",
        "Series": "Vivobook",
        "Screen Size": "14 Inches",
        "Color": "Blue",
        "Hard Disk Size": "1 TB",
        "CPU Model": "Intel Core i3",
        "Ram Memory Installed Size": "12 GB",
        "Operating System": "Windows 11",
        "Special Feature": "Fingerprint",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 11,
      "name": "Logitech MX Mechanical Wireless",
      "about": "Fluid and quiet mechanical typing: MX Mechanical keyboard features Tactile Quiet switches that deliver next-level feel and flow with less noise - Clicky and Linear switches are also available.Topcase: Low Carbon Aluminum Low-profile keys, more comfort: A keyboard layout designed for effortless precision, with a full-size form factor and low-profile mechanical switches for better ergonomics, Caps Lock and Battery indication Smart illumination: Backlit keys light up the moment your hands approach the cordless keyboard and automatically adjust to suit changing lighting conditions Faster workflow, more customization: Customize Fn keys, assign backlighting effects, enable Flow cross-computer, multi-device control, and more in the improved Logi Options+ (1) Multi-device, multi-OS: Pair MX Mechanical Bluetooth wireless keyboard with up to 3 devices on nearly any operating system via Bluetooth Low Energy or included Logi Bolt receiver(2) USB-C quick charging: MX Mechanical keyboard stays powered up to 15 days on a full charge or up to 10 months with the backlighting turned off (3) Battery: Rechargeable Li-Po (1500 mAh) battery, Compatible with Logitech Flow technology enabled mouse",
      "url": "https://m.media-amazon.com/images/I/61++ok6AqtL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 169.99,
      "description": {
        "Brand": "Logitech",
        "Compatible Devices": "Smartphone",
        "Connectivity Technology": "USB",
        "Keyboard Description": "Mechanical",
        "Recommended Uses For Product": "Office",
        "Special Feature": "Graphite",
        "Color": "Linux, iPadOS 14, macOS 10.15, Chrome OS, iOS 14, Android 8.0, Windows 11, Windows 10",
        "Operating System": "104",
        "Number of Keys": "Single Color"
      }
    },
    {
      "id": 12,
      "name": "Acer Aspire 5 A515-56-347N",
      "about": "Powerful Productivity: 11th Generation Intel Core i3-1115G4 Dual Core processor delivers unmatched speed and intelligence, enabling impressive creating, productivity, and gaming experiences. With Turbo Boost Technology, get up to 4.1GHz for your high-demand applications. Connectivity Technology: Wi-Fi, Bluetooth, HDMI Visibly Stunning: Experience sharp details and crisp colors on the 15.6\" Full HD IPS display with 82.58% screen-to-body, 16:9 aspect ratio and narrow bezels. Ergonomic Typing: Ergonomically designed hinge lifts the keyboard for comfortable typing, improved cooling, and a better sound experience. Internal Specifications: 8GB DDR4 on-board memory (1 slot available); 128GB NVMe solid-state drive storage (1 hard drive bay available) to store your files and media Acer's Purified.Voice technology, features enhanced digital signal processing to cancel out background noise, improve speech accuracy and far-field pickup, which not only makes calls clearer, but makes talking to Alexa easier than before. Using Alexa on your PC is as easy as asking a question. Just ask and Alexa can check your calendar, create lists, play music, answer questions, read the news and more. Secure Operating System: Windows 11 Home in S mode comes with advanced security features built right in, like protections against phishing and malicious software so you don't have to think twice when navigating to a new webpage or downloading an app. › See more product details",
      "url": "https://m.media-amazon.com/images/I/71pvhTrmZDL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 299.99,
      "description": {
        "Brand": "Acer",
        "Series": "A515-56-347N",
        "Screen Size": "15.6 Inches",
        "Color": "Silver",
        "Hard Disk Size": "128 GB",
        "CPU Model": "Core I3 1115G4",
        "Ram Memory Installed Size": "8 GB",
        "Operating System": "Windows 11 S",
        "Special Feature": "Amazon Alexa",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 13,
      "name": "Acer Aspire 3 A315-24P-R7VH",
      "about": "Purposeful Design: Travel with ease and look great doing it with the Aspire's 3 thin, light design. Ready-to-Go Performance: The Aspire 3 is ready-to-go with the latest AMD Ryzen 3 7320U Processor with Radeon Graphics—ideal for the entire family, with performance and productivity at the core. Visibly Stunning: Experience sharp details and crisp colors on the 15.6\" Full HD IPS display with 16:9 aspect ratio and narrow bezels. Internal Specifications: 8GB LPDDR5 Onboard Memory; 128GB NVMe solid-state drive storage to store your files and media The HD front-facing camera uses Acer’s TNR (Temporal Noise Reduction) technology for high-quality imagery in low-light conditions. Acer PurifiedVoice technology with AI Noise Reduction filters out any extra sound for clear communication over online meetings. Wireless Wi-Fi 6 Convenience: Maintain a strong, consistent wireless signal with Wi-Fi 6 (aka 802.11ax) and 2x2 MU-MIMO technology. Improved Thermals: With a 78% increase in fan surface area, enjoy an improved thermal system and an additional 17% thermal capacity. Allowing for longer, more efficient work sessions while not plugged in. Ports For All Your Accessories: 1 - USB Type-C Port USB 3.2 Gen 2 (up to 10 Gbps) DisplayPort over USB Type-C & USB Charging, 2 - USB 3.2 Gen 1 Ports, 1 - HDMI 2.1 Port with HDCP support, 1 - Headphone/Speaker/Line-Out Jack, DC-in for AC adapter What's In the Box: Acer Aspire Laptop, AC Adapter, Power Cord Show more",
      "url": "https://m.media-amazon.com/images/I/71+1lOl1Y1L._AC_SX355_.jpg",
      "category": "laptop",
      "price": 329.99,
      "description": {
        "Brand": "Acer",
        "Series": "A315-24P-R7VH",
        "Screen Size": "15.6 Inches",
        "Color": "Silver",
        "Hard Disk Size": "128 GB",
        "CPU Model": "Ryzen 3",
        "Ram Memory Installed Size": "8 GB",
        "Operating System": "Windows 11 S",
        "Card Description": "Integrated",
        "Graphics Coprocessor": "AMD Radeon Graphics"
      }
    },
    {
      "id": 14,
      "name": "Logitech K480 Wireless Multi-Device",
      "about": "Type on Any Device: A new type of wireless computer keyboard for your desk that also works with your tablet and smartphone; connect with any Bluetooth-enabled device with external keyboard support. Wireless range: > 10m wireless range Easy-Switch Dial: Simply turn the dial of the Logitech K480 keyboard to switch typing between 3 connected Bluetooth wireless devices, you can work with Windows, macOS, Chrome OS, Android, and iPadOS Familiar Keyboard Layout: Find all the shortcut keys you use the most, but in a space-saving design that lets you place your mouse close to you, for less arm reaching and better posture Integrated Cradle: A cradle to hold your phone or tablet at just the right angle for you to read while you type; fits most phones and tablets up to 0.4 inches thick and 10 inches wide Reliable Power: This portable, wireless Bluetooth keyboard comes with 2 pre-installed AAA batteries which can last up to 24 months (2) and is compatible with wired, wireless or Bluetooth mice. Battery indicator light Durable and Spill-resistant: The wireless and compact keyboard K480 is also spill-resistant (1) to survive small accidents; it’s a reliable and durable partner for your desk at home, or at work Upgrade to Logitech K780 Keyboard: For more productivity and comfort, try the K780 keyboard with number pad for efficient data inputs, Bluetooth/USB, scooped keys, and cradle to hold your phone For Windows, Mac or Chrome computers, Android or iOS mobile devices. Weight: 820 g (1.81 pounds) Show more",
      "url": "https://m.media-amazon.com/images/I/61fl+k9O-FL._AC_SY355_.jpg",
      "category": "keyboard",
      "price": 34.99,
      "description": {
        "Brand": "Logitech",
        "Compatible Devices": "Laptop, PC, Tablet, Smartphone",
        "Connectivity Technology": "Bluetooth",
        "Keyboard Description": "Integrated",
        "Recommended Uses For Product": "Work, Home",
        "Special Feature": "Portable, Spill Resistant, Hotkeys and Media Keys",
        "Color": "Black",
        "Operating System": "104",
        "Number of Keys": "Single Color"
      }
    },
    {
      "id": 15,
      "name": "Apple iPhone 8 Plus,",
      "about": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.). Tested for battery health and guaranteed to have a minimum battery capacity of 80%. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable. Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arms length.",
      "url": "https://m.media-amazon.com/images/I/31Tr8JsfVpL._AC_.jpg",
      "category": "phone",
      "price": 160.99,
      "description": {
        "Brand": "Apple",
        "Model Name": "iPhone 8 Plus",
        "Wireless Carrier": "Unlocked",
        " OS ": "iOS 12",
        "Cellular Technology": "GSM, CDMA",
        "Memory Storage Capacity": "64 GB",
        " Connectivity technologies ": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Space Gray",
        "Screen Size": "5.5 Inches",
        "Wireless network technology": "GSM, CDMA"
      }
    },
    {
      "id": 16,
      "name": "Logitech 981-000536 G430 7.1",
      "about": "DTS Headphone: X and Dolby 7; 1 surround Sound: experience an immersive 360 degree sound field that lets you hear what you can't see Built for comfort: lightweight design and soft sport cloth ear cups with 90 degree swivel for maximum comfort and a personalized fit Folding, noise cancelling boom mic: reduces background noise for clear voice pick up and rotates up and out of the way Impedance: 32 ohms; On cable sound controls: volume dial and mute switch are close at hand for quick Audio adjustments Compatibility: Works with PS4 and Windows 10, Windows 8, Windows 7 or windows Vista computers; Sensitivity: 90dB SPL/mw.Cable Length: 10.5 ft Headphone frequency response: 20Hz 20KHz; Microphone pickup pattern: cardioid (unidirectional) frequency response: 50 20khz; Please note: kindly refer the user guide before use",
      "url": "https://m.media-amazon.com/images/I/81xlboCOT9L._AC_SY355_.jpg",
      "category": "headset",
      "price": 184.99,
      "description": {
        "Brand": "Logitech",
        "Series": "G430",
        "Color": "Blue/Black",
        "Form Factor": "closed-back",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 17,
      "name": "2022 HP Pavilion 17",
      "about": "【Processor】AMD Ryzen 3 3250U (2.6 GHz base clock, up to 3.5 GHz max boost clock, 4 MB L3 cache, 2 cores, 4 threads)| AMD Radeon Graphics 【Display】17.3\" diagonal, HD+ (1600 x 900), touch, BrightView, 250 nits, 60% NTSC, enjoy your photos, movies, and games with the crisp quality. 【RAM and Storage】RAM is upgraded to 16GB high-bandwidth RAM (Model #:7EH99AA#ABB) to smoothly run multiple applications and browser tabs all at once; Hard Drive is upgraded to 256GB PCIe NVMe Solid State Drive + 1TB Hard Disk Drive allows to fast bootup and data transfe and large file storage. 【Tech Specs】1 SuperSpeed USB Type-C 5Gbps signaling rate, 2 SuperSpeed USB Type-A 5Gbps signaling rate, 1 HDMI 1.4b, 1 AC smart pin, 1 headphone/microphone combo | Webcam | Wi-Fi 6| Bluetooth 5.2 | Windows 10 Home 64-bit (Free Upgrade to Windows 11 Home) 【Included in the package】Bundled with Oydisen Cloth › See more product details",
      "url": "https://m.media-amazon.com/images/I/61gPlWZqHIL._AC_SX450_.jpg",
      "category": "laptop",
      "price": 628.99,
      "description": {
        "Brand": "HP",
        "Series": "Pavilion 17",
        "Screen Size": "17.3 Inches",
        "Color": "Silver",
        "Hard Disk Size": "256 GB",
        "CPU Model": "Ryzen 3 3250U",
        "Ram Memory Installed Size": "16 GB",
        "Operating System": "Windows 10",
        "Card Description": "Integrated",
        "Graphics Coprocessor": "AMD Radeon™ Graphics"
      }
    },
    {
      "id": 18,
      "name": "NPET K10 Wired Gaming",
      "about": "IP32 Spill Resistance: With durable construction that repels liquids and dirt for easy cleanup. Capable of withstanding accidental spills. Adjustable feet let you set your keyboard to the ideal position, so it's comfortable to use even during the longest gaming sessions. Durable Full-Sized Gaming Keyboard: Made with highly-resistant ABS plastic and metal base for longevity, and durability. With a mechanical brown switch gaming feeling that delivers precise tactile feedback and responsiveness. 10-Zone RGB Lighting: With 16.8 million colors and a suite of effects to choose from, press FN+M1~M5 to personalize the keyboard and get access to dynamic lighting effects. Dedicated Media Control & Anti Ghosting: It has 26 conflict-free that keep you in control when you press multiple gaming keys simultaneously. 13 dedicated media keys can control your background track without switching out of your game. Wear Resistant Doubleshot ABS Keycaps: The UV coating ensures more fade-resistant legends and greater protection against wear and tear from frequent use. The ergonomic stair-up keycap design brings maximum comfort keeping your hand in a natural state to minimize hand fatigue.",
      "url": "https://m.media-amazon.com/images/I/7113k0qNblL._AC_SX450_.jpg",
      "category": "keyboard",
      "price": 19.99,
      "description": {
        "Brand": "NPET",
        "Compatible Devices": "Compatible with Windows 95/98/XP/2000/ME/VISTA/7/8/10 and Mac OS",
        "Connectivity Technology": "USB",
        "Keyboard Description": "Gaming, Membrane, Multimedia, Mechanical",
        "Recommended Uses For Product": "Office, Multimedia, Gaming",
        "Special Feature": "Backlit, Spillproof, Ergonomic, Water Resistant, Fade Resistant, Doubleshot ABS Keycaps",
        "Color": "Black",
        "Operating System": "Linux, Windows XP, Windows 8, Windows 10",
        "Number of Keys": "104",
        "Keyboard backlighting color support": "RGB"
      }
    },
    {
      "id": 19,
      "name": "Apple iPhone X, US",
      "about": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.). Tested for battery health and guaranteed to have a minimum battery capacity of 80%. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable. Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.",
      "url": "https://m.media-amazon.com/images/I/81SSw14XZHL._AC_SX425_.jpg",
      "category": "phone",
      "price": 224.99,
      "description": {
        "Brand": "Apple",
        "Model Name": "iPhone X",
        "Wireless Carrier": "Unlocked",
        " OS ": "iOS",
        "Cellular Technology": "4G",
        "Memory Storage Capacity": "64 GB",
        " Connectivity technologies ": "USB",
        "Color": "Silver",
        "Screen Size": "5.8 Inches",
        "Wireless network technology": "GSM, CDMA"
      }
    },
    {
      "id": 20,
      "name": "Bluetooth Headphones Over Ear,BERIBES",
      "about": "🔥【Optional 6 music modes】Adopted most advanced dual 40mm dynamic sound unit and 6 EQ modes, BERIBES updated headphones wireless bluetooth black were born for audiophiles. Simply switch the headphone between balanced sound, extra powerful bass and mid treble enhancement modes. No matter you prefer rock, Jazz, Rhythm & Blues or classic music, BERIBES has always been committed to providing our customers with better sound quality as the focal point of our engineering. 🔥【65 Hours Playtime】Low power consumption technology applied, BERIBES bluetooth headphones with built-in 500mAh battery can continually play more than 65 hours, standby more than 950 hours after one fully charge. By included 3.5mm audio cable, the wireless headphones over ear can be easily switched to wired mode when powers off. No power shortage problem anymore 🔥【All Day Comfort】Made by premium materials, 0.38lb BERIBES over the ear headphones wireless bluetooth for work are the most lightweight headphones in the market. Adjustable headband makes it easy to fit all sizes heads without pains. Softer and more comfortable memory protein earmuffs protect your ear in long term using 🔥【Latest Bluetooth 5.3 and Microphone】Carrying latest Bluetooth 5.3 chip, after booting, 1-3 seconds to quickly pair bluetooth. Beribes bluetooth headphones with microphone has faster and more stable transmitter range up to 33ft. Two smart devices can be connected to Beribes over-ear headphones at the same time, makes you able to pick up a call from your phone when watching movie on your iPad without switching 🔥【After Sale Protection】Package include a Foldable Deep Bass Headphone, Carrying Bag,3.5mm backup audio cable, USB charging cable and User Manual. Provide one year money back guarantee and three year warranty, lifetime worry free user support, contact us anytime if you have any questions about the product, we will reply within 10 hours",
      "url": "https://m.media-amazon.com/images/I/71AWFpvx0XL._AC_SY355_.jpg",
      "category": "headset",
      "price": 27.99,
      "description": {
        "Brand": "BERIBES",
        "Model Name": "202A",
        "Color": "Green",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wireless, Wired"
      }
    },
    {
      "id": 21,
      "name": "Google Pixel 7a -",
      "about": "Google Pixel 7a is fast and efficient, with 8 GB of RAM, an amazing camera, and features rated highest in security[1] Pixel’s fast-charging all-day battery can last over 24 hours, or up to 72 hours when you turn on Extreme Battery Saver[2]; it also charges wirelessly With the Pixel Camera and Google Tensor G2’s advanced image processing, it’s easy to take great pictures in low light, fix blurry images, and remove distractions with a few taps in Google Photos[3] With Pixel Call Assist, you can get help making calls, avoiding spammers, and waiting on hold[4]; plus, Pixel 7a can filter out your caller’s background noise so you can hear them clearly even in noisy places Open your Pixel 7a quickly and securely with Face Unlock or Fingerprint Unlock Google Tensor G2 and the certified Titan M2 chip add layers of security to keep your personal info safe; VPN by Google One helps protect your online activity in any browser[5] Unlocked Android 5G phone gives you the flexibility to change carriers and choose your own data plan[6]; works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers With Live Translate, you can have conversations face to face in 48 languages, chat in real time with messaging apps, and translate menus with your camera[7] Your Pixel phone works seamlessly with the Google Pixel tablet, watch, and earbuds for personalized help throughout your day[9] Please refer to the “From the manufacturer” section below for all applicable legal disclaimers denoted by the bracketed numbers in the preceding bullet points (e.g., [1], [2], etc.) Show more",
      "url": "https://m.media-amazon.com/images/I/71gftOVNShL._AC_SY355_.jpg",
      "category": "phone",
      "price": 498.99,
      "description": {
        "Brand": "Google",
        "Model Name": "Pixel 7a",
        "Wireless Carrier": "Unlocked for All Carriers",
        "Operating System": "Android 13.0",
        "Cellular Technology": "5G",
        "Memory Storage Capacity": "128 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Charcoal",
        "Screen Size": "6.1 Inches",
        "Wireless network technology": "GSM, LTE"
      }
    },
    {
      "id": 22,
      "name": "ASUS TUF Gaming H1",
      "about": "DEEP BASS & CRYSTAL-CLEAR AUDIO - TUF Gaming H1 headset wired gives you the most iconic features of ASUS gaming headsets, including airtight chambers and 40 mm ASUS Essence drivers for clearer audio with deeper bass. VIRTUAL 7.1 SURROUND SOUND - Virtual 7.1 surround sound technology* provides an upgraded level of audio precision that can give you a competitive edge during gameplay. *Supported by Windows Sonic CERTIABLY CLEAR COMMUNICATION - The unidirectional analog boom microphone is tuned for clear voice communication and certified by Discord and TeamSpeak. LIGHTWEIGHT DESIGN - Weighing only 287 grams, the lightweight TUF Gaming H1 xbox headset wired is designed to keep you comfortable during extended gaming sessions. INSTANT MIC & VOLUME CONTROL - Handy and intuitive control buttons on the ear cup make it easy to adjust volume, mute or unmute the microphone on your H1 gaming headphones. MULTI-PLATFORM COMPATIBILITY - With TUF Gaming H1 headset wired, you don't need another headset for console gaming — because it provides truly comprehensive cross-platform support, including for PCs, Macs, PlayStation 4 & 5, Nintendo Switch , XBOX One & Series X | S, smartphones and tablets.",
      "url": "https://m.media-amazon.com/images/I/61-11tgfuFL._AC_SY355_.jpg",
      "category": "headset",
      "price": 34.99,
      "description": {
        "Brand": "ASUS",
        "Model Name": "TUF Gaming H1",
        "Color": "Black",
        "Form Factor": "On Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 23,
      "name": "2023 Windows 11 Laptop,",
      "about": "【10th generation intel chip】 Equipped with Intel 10th Gemini Lake Refresh series N4120 chip, This high-definition notebook computer runs smoothly, with super-fast processing speed, and can easily cope with various productivity software without stuttering.Windows 11 Pro is pre-installed and licensed;turbo frequency up to 2.6GHz, 14nm quad-core, and four-thread fast processing. 【Ultra-Restoring 1080P Display】 The ultra-thin notebook computer adopts a 15.6-inch full HD, 1920*1080 high-resolution screen, a large IPS process 16:9 display, and 100% RGB color reproduction; restores the essence of color and protects eyesight. Guaranteed high-quality sharp, lifelike images in millions of colors. 【Large-capacity full-size keyboard】 The Coolby ZealBook also has 12GB RAM, 256GB SATA SSD plus up to 256GB MicroTF interface, up to 1TB, to satisfy your study, work, and entertainment anytime, anywhere! Full-size keyboard, including QWERTY US key set, and full number pad. Enlarged keyboard size is more suitable for hand use! The enlarged version of the 6.5-inch touchpad has a larger operating space! 【Energy saving and lasting on the go】 Coolby ZealBook is a laptop with a fanless design, keeping it thin, quiet, smooth, and stylish. Built-in 34.2Wh high-density polymer lithium battery with a battery life of up to 9 hours. And at only 1.5kg, this thin and light laptop is lightweight and easy to carry. 【Multifunctional Connection Design】 In order to improve the practicality and connectivity and portability of the laptop, it has excellent wired and wireless connectivity, with 2 USB 3.0 ports, mini HDMI and 3.5mm headphone ports, DC adapter interface; dual frequency 2.4GHz/5GHz WiFi, BT4.2; support built-in microphone, and surround audio playback! We're so confident in our line of laptops and notebooks, we offer a full 12-month warranty! › See more product details",
      "url": "https://m.media-amazon.com/images/I/61TRL-yonIL._AC_SY450_.jpg",
      "category": "laptop",
      "price": 319.99,
      "description": {
        "Brand": "Coolby",
        "Series": "BCL50",
        "Screen Size": "15.6 Inches",
        "Hard Disk Size": "256 GB",
        "CPU Model": "Celeron",
        "Ram Memory Installed Size": "12 GB",
        "Operating System": "Windows 11 Pro",
        "Special Feature": "Full Size Keyboard, Fanless",
        "Card Description": "Integrated",
        "Graphics Coprocessor": "Intel UHD Graphic 600"
      }
    },
    {
      "id": 24,
      "name": "Wired Keyboard and Mouse",
      "about": "【104 KEYS LAYOUT AND ERGONOMIC DESIGN】EDJO full-sized wired keyboard is ergonomically designed with palm rest and foldable stand that can make it typing more comfortable. Anti-slip design on the bottom of the keyboard can prevent the keyboard from moving while typing, which is more stable to use. 【PLUG & PLAY AND STABLE CONNECTION】This wired keyboard mouse combo is plug and play, no needed install any drivers, wired connection can provide more stable signal input than wireless connection, more responsive typing. 【OPTICAL WIRED MOUSE】This is a optical wired mouse that can works well on a smooth surface even without a mouse pad. The mouse is symmetrical design,suitable for all users, very comfortable to hold, keeps your hands relaxed even after long time of work. 【12 MULTIMEDIA SHORTCUTS】The wired keyboard has 12 multimedia shortcuts combinations that is convenient to instant access music, volume, computer, mail, etc. it can improve work efficiency greatly. There are caps lock Indicator and number lock Indicator In the upper right corner of the keyboard. (Note: Some multimedia function are not available with Mac OS) 【WIDELY COMPATIBLE AND 12 MONTHS WARRANTY】EDJO wired keyboard and mouse combo is widely compatible with Windows XP/Vista/7/8/8.1/10, Mac and other operating systems. Suitable for Desktops, Chromebook, PC, Laptop, Computer, and more. Our product has 12 month's warranty, if you encounter any problems with the product, please contact us via email, we will provide you with excellent after-sales service.",
      "url": "https://m.media-amazon.com/images/I/61sOGNNsCRL._AC_SY355_.jpg",
      "category": "keyboard",
      "price": 19.99,
      "description": {
        "Brand": "EDJO",
        "Color": "black",
        "Connectivity Technology": "Usb",
        "Special Feature": "Ergonomic",
        "Compatible Devices": "Laptop, Personal Computer"
      }
    },
    {
      "id": 25,
      "name": "Logitech G533 Wireless Gaming",
      "about": "Logitech G gaming headset for Windows 7 and later delivers the advanced audio performance normally found in high end audiophile headphones, Custom Sound Profiles settings require Logitech Gaming Software Patent pending Pro G drivers and DTS Headphone: X 7.1 Surround Sound accurately recreate the in game environmental effects and positional audio that game designers intended you to hear Pro grade wireless audio with advanced lossless digital audio transmission gives you incredible high fidelity sound and connection strength with up to 15 meters range High performance PC gaming headset made with the latest materials and manufacturing techniques is designed to be a durable yet lightweight headset you can wear for hours Rechargeable, replaceable battery with 15 hour battery life provides extended power you can rely on for non- stop gaming sessions Windows 10, Windows 8.1, or Windows 7, Mac OS X 10.11 or later 2-year Limited hardware warranty",
      "url": "https://m.media-amazon.com/images/I/61eFyV4WLLL._AC_SY355_.jpg",
      "category": "headset",
      "price": 78.99,
      "description": {
        "Brand": "Logitech",
        "Series": "G533",
        "Color": "Black",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wireless"
      }
    },
    {
      "id": 26,
      "name": "Amazon Basics Bluetooth Wireless",
      "about": "Compact, fully-functional wireless (non-bluetooth) QWERTY keyboard for home, office, or remote work Sound-dampened keys makes working in quiet environments less disruptive Includes numeric key pad and 12 multimedia hot keys Powered by 2 AAA batteries; transmits data securely via USB receiver with 128-bit AES encryption Plug-and-play design does not require drivers or complicated set up; compatible with Windows 7, 8, and 10 Backed by an Amazon Basics 1-year limited warranty",
      "url": "https://m.media-amazon.com/images/I/71e6gpxfb+L._AC_SX355_.jpg",
      "category": "keyboard",
      "price": 26.99,
      "description": {
        "Brand": "Amazon Basics",
        "Connectivity Technology": "Bluetooth",
        "Keyboard Description": "Multimedia",
        "Recommended Uses For Product": "Office",
        "Special Feature": "Hotkeys டைTune, Multimedia Keys",
        "Color": "Black",
        "Operating System": "Windows 7",
        "Keyboard backlighting color support": "Single Color",
        "Style": "Modern",
        "Item Dimensions LxWxH": "5.61 x 1.13 x 17.83 inches"
      }
    },
    {
      "id": 27,
      "name": "Gateway Newest Touchscreen 11.6",
      "about": "Ultra Portable and Ultra-thin design with Sleek Body (.7-inch) Laptop; Windows 11 in S Mode (Switchable to W11 Home); Intel Celeron Processor N4020 (1.1 GHz, Up to 2.8 GHz, 4M Cache) 11.6” HD LCD IPS Display, (1366x768) - Touchscreen; Tuned by THX Audio; Webcam; Wifi + Bluetooth 4.0 4GB DDR4 memory; 64GB High Speed eMMc Expansion slot: Micro SD Slot (Up to 512 GB) x 1; Mini HDMI Output x 1; USB 2.0 x 1; USB 3.0 x 1. Hugo Tech Mart Mouse included › See more product details",
      "url": "https://m.media-amazon.com/images/I/51KZAsZvoIL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 169.99,
      "description": {
        "Brand": "Gateway",
        "Series": "GT11-M",
        "Screen Size": "11.6 Inches",
        "Color": "Blue",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Pentium D",
        "Ram Memory Installed Size": "4 GB",
        "Operating System": "Windows 11 S",
        "Special Feature": "Anti Glare Coating",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 28,
      "name": "Razer Kraken X Ultralight",
      "about": "CUSTOM-TUNED 40 MM DRIVERS - The superior sound clarity and punchy bass simulate a wide soundscape when gaming. From subtle footsteps to powerful explosions, in-game audio is delivered in lifelike detail. DESIGNED FOR ALL-DAY COMFORT - The lightest Kraken headset ever at 250 grams, around 40% lighter than the competition BENDABLE NOISE CANCELLING MICROPHONE - A cardioid mic reduces background and ambient noises for crystal-clear communication 3.5mm CONNECTION - The superior sound clarity and punchy bass simulate a wide soundscape when gaming. From subtle footsteps to powerful explosions, in-game audio is delivered in lifelike detail. DURABLE CONSTRUCTION - The Kraken X frame is flexible and built to last, able to withstand daily, care-free use",
      "url": "https://m.media-amazon.com/images/I/61emnvMdApS._AC_SX355_.jpg",
      "category": "headset",
      "price": 29.99,
      "description": {
        "Brand": "Razer",
        "Series": "Kraken X Console",
        "Color": "Black/Green",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 29,
      "name": "Samsung Galaxy S10e, 128GB,",
      "about": "Fully Unlocked: Fully unlocked and compatible with any carrier of choice (e.g. AT&T, T-Mobile, Sprint, Verizon, US-Cellular, Cricket, Metro, etc.), both domestically and internationally. The device does not come with headphones or a SIM card. It does include a charger and charging cable that may be generic. Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. Tested for battery health and guaranteed to have a minimum battery capacity of 80%.",
      "url": "https://m.media-amazon.com/images/I/71bK3oKRCOL._AC_SX385_.jpg",
      "category": "phone",
      "price": 124.99,
      "description": {
        "Brand": "SAMSUNG",
        "Model Name": "Galaxy S10e",
        "Wireless Carrier": "Unlocked",
        " OS ": "Android",
        "Cellular Technology": "GSM, LTE",
        "Memory Storage Capacity": "128 GB",
        " Connectivity technologies ": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Prism Black",
        "Screen Size": "5.8 Inches",
        "Wireless network technology": "GSM, Wi-Fi"
      }
    },
    {
      "id": 30,
      "name": "Astro A10 Gaming Headset",
      "about": "Enhanced sound quality: ASTRO Gaming A10 Gen 2 Headset for Xbox Series X|S, Xbox One, PlayStation 5, PlayStation 4, Nintendo Switch, PC, Mac features custom-tuned 32mm dynamic drivers so you can always hear your game and teammates with clarity and precision.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ear Flip-to-mute mic: Integrated boom microphone that can be flipped up to mute for privacy and down for crystal-clear comms via a 6.0 mm unidirectional mic In-line volume control: This gaming headset features a removable headphone cable with in-line volume control, letting you adjust audio without pausing the game Built to last: An ultra durable headband and sturdy construction offers reliable performance that transcends the standard gaming headset Comfortable over-ear headset: Ergonomical and robust circumaural construction with a closed back design; optimal for long sessions Replaceable ear cushions and headband pad removes the need to purchase a new headset, simply replace worn cushions and pads as needed. Compatibility: PS5, PS4, PC/Mac, Xbox Series X|S, Xbox One, Nintendo Switch, VR, Streaming",
      "url": "https://m.media-amazon.com/images/I/61gC6PBsRPL._AC_SY355_.jpg",
      "category": "headset",
      "price": 44.99,
      "description": {
        "Brand": "ASTRO Gaming",
        "Model Name": "A10 Gen 2",
        "Color": "Grey",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 31,
      "name": "Logitech G332 Wired Gaming",
      "about": "Enjoy expansive sound: Big 50 mm audio drivers deliver an incredible sound experience. Be Heard Loud and Clear: The big 6 mm boom mic makes sure you’re heard by gaming partners and mutes when flipped up. Use One Headset For All Game Platforms: Your headphones work with your PC or Mac via 3.5 mm cable, or with gaming consoles including PlayStationⓇ 5 and PlayStationⓇ 4 (USB wireless stereo sound only), Nintendo Switch (wireless stereo sound when docked), Xbox One and Xbox Series X|S and mobile devices via a 3.5 mm cable. Game for Hours in Comfort: Everything about these headphones is about comfort: The deluxe lightweight leatherette ear cups and headband are made to keep pressure off your ears. Ear cups rotate up to 90 degrees for convenience.",
      "url": "https://m.media-amazon.com/images/I/61QRH3xXoCL._AC_SY355_.jpg",
      "category": "headset",
      "price": 184.99,
      "description": {
        "Brand": "Logitech G",
        "Series": "Logitech G332 Stereo Gaming Headset for PC, PS4, Xbox One, Nintendo Switch",
        "Color": "BLACK",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "HDMI"
      }
    },
    {
      "id": 32,
      "name": "Lenovo 3i Chromebook -",
      "about": "Multitask at full power: With Chrome OS, ask Google to help you manage different tasks and stay productive, you can manage device actions, schedule calendar events, set reminders, and more, just say “Ok Google” to get started Made for ease of use: The Lenovo 3i Chromebook was made with an easy-to-flip lid, large touchpad, and an added numpad, you can watch shows with fewer distractions on a 15\" FHD display with narrow bezels for more screen real estate and wider viewing angles Crank up those tunes all day: Stream audio that’s remarkably loud and clear from user-facing stereo speakers Security you can count on: Each time your Chromebook starts up, it goes through a rigorous and seamless security check-up that prevents malware. F ; furthermore, your Chromebook updates every six weeks with the latest protections Made to do more: With up to 10 hours of battery life on a single charge and one USB Type-C ports, two USB 3.0 ports, one HDMI port, as well as one microSD card reader, and one audio combo jack › See more product details",
      "url": "https://m.media-amazon.com/images/I/51pwqs5xEcL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 299.99,
      "description": {
        "Brand": "Lenovo",
        "Series": "IdeaPad 3",
        "Screen Size": "15.6 Inches",
        "Color": "Blue",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Celeron P4500",
        "Ram Memory Installed Size": "8 GB",
        "Operating System": "Chrome OS",
        "Special Feature": "Narrow",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 33,
      "name": "Wireless Keyboard and Mouse",
      "about": "【Stable 2.4G Wireless Connection】Powerful and reliable connection of wireless keyboard mouse is up to 10 m(393.7in). Wireless keyboard with mouse combo share a Nano receiver (stored at the bottom of the mouse) without installing any additional software, plug and play. Keep your desk clean and tidy. 【Efficient Desktop Keyboard Wireless + Wide Compatibility】The wireless computer keyboard preserving the keys of the numeric keypad, the full-size keyboard has 11 function keys allows you to quickly access the music/volume/mail, etc(The hot-keys not fully compatible with Mac System). The keyboard mouse combo wireless is compatible with Windows XP / ME/ Vista / 7 / 8 /10 / 11 operating systems. Work well with devices which has USB slot like PC, Laptop, Macbook, desktop, Chrome-book, Smart TV. 【Silent Keyboard and Mouse】The wireless office keyboard’ s scissor switch keys provide less noise. Light and responsive tactile keystroke makes typing soft and comfortable. Silent cordless mouse has 2 DPI levels (1200/1600). It is fast and precise, keep quiet while maintaining sensitivity. Never worry about disturbing others to rest while working or playing. 【Ultra-Slim and Portable Design】Wireless pc keyboard has 14.55x5.5x0.8in(37*14*2cm), 0.8in(2cm) ultra-thin ABS plastic body, which can save space and easy to carry. Kit keyboard and mouse wireless’s sleek design is super match with office desk. Perfect for business travel, office, home, library and many public occasions. 【Battery Included + Keyboard Cover】 Long-lasting basic AA and AAA batteries are included in the wireless keyboard and mice combo, battery life between 3 and 5 months(varies by usage conditions). The included cover can protect your wireless office keyboard from dust and liquid. 1-Year Warranty: If quality problem with wireless keyboard & mouse set occur within one year, we will replace the new one to you for free. 【Conexión Inalámbrica Estable de 2.4G】La conexión potente y confiable del mouse con teclado inalámbrico es de hasta 10 m (393.7in). El combo de teclado inalámbrico con mouse comparte un receptor Nano (almacenado en la parte inferior del mouse) sin instalar ningún software adicional, plug and play. Mantenga su escritorio limpio y ordenado. 【Teclado de Escritorio Eficiente Inalámbrico + Amplia Compatibilidad】El teclado ordenador inalámbrico que conserva las teclas del teclado numérico y el teclado de tamaño completo. El teclado ergonomico español y las 11 teclas de función le permiten acceder rápidamente a la música / controlar el volumen / correo, etc. El combo inalámbrico de teclado y ratón es compatible con los sistemas operativos Windows XP / ME / Vista / 7/8/10 / OS. 【Teclado y Ratón Silenciosos】Las teclas del interruptor de tijera del teclado de oficina inalámbrico proporcionan menos ruido. La pulsación de tecla táctil ligera y sensible hace que escribir sea suave y cómodo. El mouse inalámbrico silencioso tiene 2 niveles de DPI (1200/1600). Es rápido y preciso, guarda silencio mientras mantiene la sensibilidad. Nunca se preocupe por molestar a los demás para que descansen mientras trabaja o juega. 【Diseño Ultradelgado y Portátil】 El teclado inalámbrico PC tiene un cuerpo de plástico ABS ultrafino de 14.55x5.5x0.8in (37 * 14 * 2cm), 0.8in (2cm), que puede ahorrar espacio y es fácil de transportar. El elegante diseño del kit de teclado y mouse inalámbricos combina perfectamente con el escritorio de la oficina. Perfecto para viajes de negocios, oficina, hogar, biblioteca y muchas ocasiones públicas. 【Batería Incluida + Cubierta del Teclado】 Se incluyen baterías AA y AAA básicas de larga duración en el combo de teclado y mouse inalámbricos, la duración de la batería es de entre 3 y 5 meses (varía según las condiciones de uso). La cubierta incluida puede proteger su teclado silencioso de oficina inalámbrico del polvo y los líquidos. Garantía de 1 Año: si ocurre un problema de calidad con el ratón y teclado inalámbrico dentro de un año, le reemplazaremos el nuevo de forma gratuita. Show more",
      "url": "https://m.media-amazon.com/images/I/71wyySRjQyL._AC_SY355_.jpg",
      "category": "keyboard",
      "price": 34.99,
      "description": {
        "Brand": "TopMate",
        "Color": "White-US 1600DPI",
        "Connectivity Technology": "Usb, Radio Frequency",
        "Special Feature": "Numeric Keypad",
        "Compatible Devices": "Laptop, Personal Computer"
      }
    },
    {
      "id": 34,
      "name": "HyperX Cloud II -",
      "about": "15-25kKhz Frequency Response.Headphones fit type:Over-Ear Designed for comfort: Exceptionally comfortable memory foam ear cushions and padded leatherette headband help keep you focused on gaming Supreme audio quality: Large 53 millimeter drivers provide high-quality audio. Hear in-game details better and get the in-game advantage on your opponents 7.1 virtual surround sound: Truly immerse yourself in your games with hardware-driven virtual 7.1 surround sound for precisely located audio Passive noise cancellation: The closed ear cup design blocks out outside distractions to keep you in the game Built to last: The solid, durable aluminum frame is built to withstand the blows of daily use Detachable, noise-cancelling microphone: TeamSpeak and Discord certified so you can chat with your friends and your callouts will be heard loud and clear Compatibility: 7.1 virtual surround sound on PC & Mac. Stereo on PS4, Xbox One, Nintendo Switch, and mobile devices",
      "url": "https://m.media-amazon.com/images/I/71M5l+O4OFL._AC_SY355_.jpg",
      "category": "headset",
      "price": 61.99,
      "description": {
        "Brand": "HyperX",
        "Model Name": "HyperX Cloud II",
        "Color": "Gun metal",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 35,
      "name": "Apple iPhone XR, 64GB,",
      "about": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.). Tested for battery health and guaranteed to have a minimum battery capacity of 80%. Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information. The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charger and charging cable. Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.",
      "url": "https://m.media-amazon.com/images/I/31ILQoX1tSL._AC_SX425_.jpg",
      "category": "phone",
      "price": 220.99,
      "description": {
        "Brand": "Apple",
        "Model Name": "iphone XR",
        "Wireless Carrier": "Unlocked",
        " OS ": "iOS 12",
        "Cellular Technology": "LTE, CDMA, EV-DO, UMTS, HSPA, HSDPA, GSM, EDGE",
        "Memory Storage Capacity": "64 GB",
        " Connectivity technologies ": "Bluetooth, NFC",
        "Color": "Black",
        "Screen Size": "6.1 Inches",
        "Wireless network technology": "GSM, CDMA"
      }
    },
    {
      "id": 36,
      "name": "jumper Laptop 16 Inch",
      "about": "【Powerful Ultrabook】 The Jumper PC notebook is powered by Celeron J4105 Quad core processor with a turbo frequency of 2.5GHz and has integrated Intel UHD 600 Graphics. It can smoothly load applications and provide stable performance. Additionally, the laptop is pre-installed with 1 year-Office 365 and the latest Windows 11 home system to fit your needs. 【Fullview HD Screen】 Jumper 16-inch laptop has high-definition display with an optimal resolution of 1920 x 1200 pixels. A stunning 16 : 10 widescreen display with 93% screen-to-body ratio gives you morespace to stream, edit, and create. 【DIY Storage Available】 The Windows 11 laptop has 4GB LPDDR4 RAM, 128GB ROM Storage . It also supports 1TB SSD and 256GB TF card expansion, so you have enough space for large files and various streaming media you need. 【Four Stereo Speakers】 The Ultrabook comes with four high quality stereo speakers for a more immersive sound experience, and the large screen with stereo speakers makes watching videos as immersive as it is. 【Long Lasting Battery and High-Speed Transmission】 The laptop has a 38000mWh large capacity battery, which lasts for 7 to 8 hours of comprehensive usage. Further, with the help of AC dual band WiFi, Bluetooth 4.0, standard USB3.0 and Type-C for easy connection to various peripherals and high-speed wireless transmission. Also, HDMI output for high definition audio, video. › See more product details",
      "url": "https://m.media-amazon.com/images/I/81d2r5VCPkL._AC_SX450_.jpg",
      "category": "laptop",
      "price": 279.99,
      "description": {
        "Brand": "jumper",
        "Series": "EZbook S5 Max",
        "Screen Size": "16 Inches",
        "Color": "Gray",
        "Hard Disk Size": "128 GB",
        "CPU Model": "Celeron",
        "Ram Memory Installed Size": "4 GB",
        "Operating System": "Windows 11 Home",
        "Special Feature": "HD Audio, Memory Card Slot, Numeric Keypad",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 37,
      "name": "Logitech K380 Wireless Multi-Device",
      "about": "WORK FROM ANYWHERE: This slim Bluetooth wireless keyboard works with computers, laptops, phones or tablets-with a lightweight design, minimalist-size layout, so you can multitask at home or on the go. TYPE ON ANYTHING: connects to all Bluetooth wireless devices with external keyboard support. Map keys and layouts for Windows, Mac, Chrome OS, Android, iOS, and even Apple TV. EASY-SWITCH & TYPE: Pair with up to three devices—even with different operating systems— and switch between them with a tap. So you can type, switch, and keep on typing. Programmable multimedia keys. COMFORTABLE LAPTOP-STYLE TYPING: extra-small keyboard footprint allows for less arm reaching and better body posture. Scooped, low-profile keys offer a fluid, quiet, familiar laptop-style typing. WORRY-FREE 2-YEAR BATTERY LIFE: Two years, two AAA alkaline batteries—pre-installed. With smart auto power-saving technology and on/off button. Durable and resistant frame with QWERTY Layout.",
      "url": "https://m.media-amazon.com/images/I/61oBWinLpzL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 36.99,
      "description": {
        "Brand": "Logitech",
        "Compatible Devices": "Laptop, PC, Tablet, Smartphone",
        "Connectivity Technology": "Bluetooth",
        "Keyboard Description": "Multi Functional",
        "Recommended Uses For Product": "Office, Home",
        "Special Feature": "Compact Space Saving",
        "Color": "Off White",
        "Operating System": "80",
        "Number of Keys": "Single Color"
      }
    },
    {
      "id": 38,
      "name": "Total by Verizon TCL",
      "about": "Carrier: This phone is locked to Total by Verizon, which means this device can only be used on the Total by Verizon wireless network. Power, save, and savor everything you do with a 3,000mAh battery. A 8MP rear camera powered by Google Lens with the ability to capture moments you'll love watching back on a 6.1\" HD+ NXTVISION display. 32GB of expandable memory, 3GB Ram, Bluetooth 5.0 Compatible with our no-contract talk, text & data plans that start at $30/mo.",
      "url": "https://m.media-amazon.com/images/I/718+xprSIBL._AC_SY355_.jpg",
      "category": "phone",
      "price": 38.99,
      "description": {
        "Brand": "Total by Verizon",
        "Model Name": "TCL 30 Z",
        "Wireless Carrier": "Verizon",
        "Operating System": "Android 12.0",
        "Cellular Technology": "4G",
        "Memory Storage Capacity": "32 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi, USB",
        "Color": "BLACK",
        "Screen Size": "6.1 Inches",
        "Wireless network technology": "LTE"
      }
    },
    {
      "id": 39,
      "name": "Newest HP 14\" HD",
      "about": "14\" diagonal HD SVA BrightView micro-edge WLED-backlit (1366 x 768), Intel Celeron N up to 2.6 GHz burst frequency, 4 MB cache, 2 cores Intel Integrated UHD Graphics 600, 64GB eMMC Hard Drive 4GB DDR4-2400 SDRAM, 802.11 ac 2X2 Wi-Fi and Bluetooth 2 USB 3.1 Gen 1; 1 USB 2.0; 1 HDMI 1.4; 1 headphone/microphone combo, Micro SD media card reader, DTS Studio Sound with dual speakers,Full-size island-style keyboard, Front-facing Webcam with integrated digital microphone Windows 11 › See more product details",
      "url": "https://m.media-amazon.com/images/I/61MGsq1ZVaL._AC_SX450_.jpg",
      "category": "laptop",
      "price": 207.99,
      "description": {
        "Brand": "HP",
        "Series": "HP 14inch Laptop",
        "Screen Size": "14 Inches",
        "Color": "Dale Pink",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Celeron",
        "Ram Memory Installed Size": "4 GB",
        "Operating System": "Windows 11 S",
        "Special Feature": "Anti Glare Coating",
        "Card Description": "Integrated"
      }
    },
    {
      "id": 40,
      "name": "BENGOO G9000 Stereo Gaming",
      "about": "【Multi-Platform Compatible】Support PlayStation 4, New Xbox One, PC, Nintendo 3DS, Laptop, PSP, Tablet, iPad, Computer, Mobile Phone. Please note you need an extra Microsoft Adapter (Not Included) when connect with an old version Xbox One controller. 【Surrounding Stereo Subwoofer】Clear sound operating strong brass, splendid ambient noise isolation and high precision 40mm magnetic neodymium driver, acoustic positioning precision enhance the sensitivity of the speaker unit, bringing you vivid sound field, sound clarity, shock feeling sound. Perfect for various games like Halo 5 Guardians, Metal Gear Solid, Call of Duty, Star Wars Battlefront, Overwatch, World of Warcraft Legion, etc. 【Noise Isolating Microphone】Headset integrated onmi-directional microphone can transmits high quality communication with its premium noise-concellng feature, can pick up sounds with great sensitivity and remove the noise, which enables you clearly deliver or receive messages while you are in a game. Long flexible mic design very convenient to adjust angle of the microphone. 【Great Humanized Design】Superior comfortable and good air permeability protein over-ear pads, muti-points headbeam, acord with human body engineering specification can reduce hearing impairment and heat sweat.Skin friendly leather material for a longer period of wearing. Glaring LED lights desigend on the earcups to highlight game atmosphere. 【Effortlessly Volume Control】High tensile strength, anti-winding braided USB cable with rotary volume controller and key microphone mute effectively prevents the 49-inches long cable from twining and allows you to control the volume easily and mute the mic as effortless volume control one key mute.",
      "url": "https://m.media-amazon.com/images/I/61CGHv6kmWL._AC_SY450_.jpg",
      "category": "headset",
      "price": 21.99,
      "description": {
        "Brand": "BENGOO",
        "Series": "G9000",
        "Color": "Blue",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 41,
      "name": "Emonoo Wired Headphone with",
      "about": "【IMMERSIVE STEREO SOUND FOR PS4/PS5/XBOX】The 50mm ultra-large high-fidelity neodymium speakers allow you to hear the various sound effects of the game clearly. You can concentrate more on the joy of the game and experience the immersive feeling. 【Noise Cancelling Mic】The flexible omnidirectional microphone precise captures the user's voice and eliminates unwanted background noise at the same time. High-fidelity large dynamic microphone to ensure smooth communication between team operations.It has excellent noise cancelling. 【More Comfort】The gaming headphones design with breathable protein over ear pads, retractable head beam flexibly fits the head. Soft memory Earmuffs prevent hard plastic from pressing against your ears. Since the headphone uses softer memory foam, this headset is not only suitable for adults, but also for children. 【High-end Fashion Braided Wire】Durable and stretch resistant, anivia wired headphones effectively reducing the resistance brought by the outside world. Equipped with remote control, it is convenient for the player to control with any hand type, and it is more handy in the game. 【About Emonoo】Emonoo is a sub-brand of Anivia and has the same manufacturing technology as Anivia. In the future, we will distinguish between games and daily use, and Emonoo will be responsible for accessories for game equipment. Headset with mic well compatible with PS4, PS4 Pro/slim, PS5, Xbox One, Xbox One S/X, PC, laptop, Mac, smartphones, Nintendo Switch/3DS Mac smartphones and other devices with 3. 5mm phone jack.",
      "url": "https://m.media-amazon.com/images/I/61qyAOglkCL._AC_SY450_.jpg",
      "category": "headset",
      "price": 19.99,
      "description": {
        "Brand": "Emonoo",
        "Model Name": "602",
        "Color": "Purple",
        "Form Factor": "Over Ear",
        "Connectivity Technology": "Wired"
      }
    },
    {
      "id": 42,
      "name": "HP Chromebook x2 11-da0023dx",
      "about": "HP Chromebook x2 11-da0023dx 11\" Qualcomm Snapdragon 7c 8 GB memory; 64 GB eMMC storage Natural silver aluminum & Night Teal › See more product details",
      "url": "https://m.media-amazon.com/images/I/71VNpJ5wqVL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 239.99,
      "description": {
        "Brand": "HP",
        "Series": "Qualcomm Snapdragon 7c",
        "Screen Size": "11 Inches",
        "Color": "Natural Silver Aluminum & Night Teal",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Snapdragon",
        "Ram Memory Installed Size": "8 GB",
        "Operating System": "Chrome OS",
        "Card Description": "Integrated",
        "CPU Speed": "2133 MHz"
      }
    },
    {
      "id": 43,
      "name": "SAMSUNG Galaxy S23 Ultra",
      "about": "CAPTURE THE NIGHT IN LOW LIGHT: Whether you’re headed to a concert or romantic night out, there’s no such thing as bad lighting with Night Mode; Galaxy S23 Ultra lets you capture epic content in any setting with stunning Nightography HIGHEST PHONE CAMERA RESOLUTION: Create crystal-clear content worth sharing with Galaxy S23 Ultra’s 200MP camera — the highest camera resolution on a phone; Whether you’re posting or printing, Galaxy S23 Ultra always does the moment justice STUNNINGLY SMOOTH VIDEO: Capture incredibly smooth video during life’s most exciting moments; With Video Stabilization, this smartphone easily records daytime outdoor adventures or those spur-of-the-moment dance parties at night WRITE, DRAW, CREATE w/ S PEN: Whether you’re in Samsung Note, Microsoft Office or Google Suite, with the built-in S Pen, you can convert handwriting to text, share your creations live and keep everything on your Galaxy S23 Ultra device SNAP PICS w/ S PEN: Capture epic selfies and beautiful photos with the click of your S Pen; Simply open up the camera app and click the button on the S Pen instead of the screen; Getting that great shot just got easier FASTEST MOBILE PROCESSOR AVAILABLE: Whether you’re working hard, playing hard or doing both at the same time, smoothly switch between apps with our fastest processor ever UNLOCK SMOOTH GAMING: Game at full throttle and smoothly switch between apps; Get more done with our fastest processor ever combined with massive internal storage; And if you’re on the move, keep going with a screen that adapts to your environment BATTERY THAT POWERS YOUR DAY: Power through a packed day* or long night of gaming without worrying about your phone dying; The robust 5,000mAh battery has been fine-tuned with a smarter processor that helps manage energy usage without slowing you down MORE STORAGE. MORE MEMORIES: You’re good on storage space; With an impressive amount of storage, starting at 256GB, you can enjoy being behind the camera without the stress that comes with getting close to filling up your phone ADAPTIVE DISPLAY: Watch your content comfortably as Adaptive Vision Booster helps your screen adapt to your environment; Whether out in direct sunlight or in bed with the lights off, the contrast on Samsung Galaxy S23 Ultra's expansive screen still looks amazing Show more",
      "url": "https://m.media-amazon.com/images/I/718LuUVEOZL._AC_SY355_.jpg",
      "category": "phone",
      "price": 1154.99,
      "description": {
        "Brand": "SAMSUNG",
        "Model Name": "Samsung Galaxy S23 Ultra",
        "Wireless Carrier": "Unlocked for All Carriers",
        "Operating System": "Android 13.0",
        "Cellular Technology": "5G",
        "Memory Storage Capacity": "512 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi, USB, NFC",
        "Color": "Lavender",
        "Screen Size": "6.8 Inches",
        "Wireless network technology": "GSM, CDMA, LTE"
      }
    },
    {
      "id": 44,
      "name": "MageGee Portable 60% Mechanical",
      "about": "Mini portable 60% compact layout: MK-Box is a 68 keys mechanical keyboard have cute small size, separate arrow keys and all your F-keys you need, can use it for gaming or work while saving space. Mechanical red switch: characterized for being linear and smoother, slight key sound has no paragraph sense with minimal resistance, but fast action without a tactile bump feel which makes it easier to tap the keyboard. Classic charming blue LED backlit: Customize multiple illuminated LED light effects, supports about 15 backlight modes, press Fn + Ins can control it, FN + ←/→ control backlight speed, FN + ↑/↓ control backlight brightness. Full anti-ghosting keyboard: all 68 keys are no conflict, black grey red mash up design, ergonomic suspension double-color injection keycap, double kickstand feet adjustable typing angle and detachable usb cable, both practical and beautiful. Extensive compatibility: MageGee MK-Box mechanical keyboards use USB 2.0 connector making it compatible with Windows (2000, XP, ME, Vista, 7, 8), Linux and Mac, plug and play, no drivers or software required.",
      "url": "https://m.media-amazon.com/images/I/618zZ7u3sUL._AC_SY450_.jpg",
      "category": "keyboard",
      "price": 29.99,
      "description": {
        "Brand": "MageGee",
        "Compatible Devices": "Laptop, PC",
        "Connectivity Technology": "USB",
        "Keyboard Description": "Mechanical, Gaming",
        "Recommended Uses For Product": "Multimedia, Gaming",
        "Special Feature": "Portable, Ergonomics, Backlit, Trackpad",
        "Color": "Black/Red Switch",
        "Operating System": "Windows 2000, Windows XP, Windows Vista, Windows 7, Windows 8, Windows Vista, Mac OS",
        "Number of Keys": "68",
        "Keyboard backlighting color support": "Single Color"
      }
    },
    {
      "id": 45,
      "name": "Total by Verizon Samsung",
      "about": "Carrier: This phone is locked to Total by Verizon, which means this device can only be used on the Total by Verizon wireless network. Capture life on the go in perfect detail with a 13MP main camera. 6.5\" HD+ LCD display, and 32GB storage expandable all the way up to 1TB. Relive your memories all day long with a 5,000mAh battery. Compatible with our no-contract talk, text & data plans that start at $30/mo.",
      "url": "https://m.media-amazon.com/images/I/812woqv69CL._AC_SY355_.jpg",
      "category": "phone",
      "price": 49.99,
      "description": {
        "Brand": "Total by Verizon",
        "Model Name": "Samsung Galaxy A03s",
        "Wireless Carrier": "Verizon",
        "Operating System": "Android 11.0",
        "Cellular Technology": "4G",
        "Memory Storage Capacity": "32 GB",
        "Connectivity Technology": "Bluetooth, Wi-Fi, USB",
        "Color": "BLACK",
        "Screen Size": "6.51 Inches",
        "Wireless network technology": "LTE"
      }
    },
    {
      "id": 46,
      "name": "HP Chromebook Laptop 14a-na1043cl",
      "about": "- High-performance: Equipped with an Intel Celeron N4500 processor and 4GB of RAM, this Chromebook provides fast and responsive performance for all your computing needs. - Impressive visuals: The 14-inch Full HD (1920x1080) display offers stunning visuals and vibrant colors for an immersive viewing experience, making it great for streaming movies, browsing the web, or working on creative projects. - All-day battery life: With a battery life of up to 11 hours, you can use your Chromebook all day without worrying about running out of power. Plus, it charges quickly and efficiently, so you can get back to work or play in no time. - Sleek and lightweight design: The HP Chromebook 14a-na1043cl has a slim and lightweight design, making it easy to take with you wherever you go. It's also built with durable materials to withstand daily wear and tear. - Chrome OS: This Chromebook runs on Chrome OS, which offers a user-friendly interface and easy access to your favorite Google apps and services. Plus, it comes with built-in virus protection and automatic updates, so you can enjoy peace of mind knowing your device is secure and up-to-date. › See more product details",
      "url": "https://m.media-amazon.com/images/I/7126qfL1vhL._AC_SX355_.jpg",
      "category": "laptop",
      "price": 164.99,
      "description": {
        "Brand": "HP",
        "Series": "Chromebook",
        "Screen Size": "14 Inches",
        "Color": "Mineral Silver",
        "Hard Disk Size": "64 GB",
        "CPU Model": "Pentium D",
        "Ram Memory Installed Size": "4 GB",
        "Operating System": "Chrome OS",
        "Card Description": "Integrated",
        "Graphics Coprocessor": "Intel"
      }
    }
  ],
  "brands": [
    {
      "name": "",
      "image": ""
    },
    {
      "name": "HP",
      "image": ""
    },
    {
      "name": "Lenovo",
      "image": ""
    },
    {
      "name": "Acer",
      "image": ""
    },
    {
      "name": "Razer",
      "image": ""
    },
    {
      "name": "Apple",
      "image": ""
    },
    {
      "name": "SAMSUNG",
      "image": ""
    },
    {
      "name": "Google",
      "image": ""
    }
  ],
  "categories": [
    {
      "name": ""
    },
    {
      "name": "laptop"
    },
    {
      "name": "phone"
    },
    {
      "name": "keyboard"
    },
    {
      "name": "headset"
    }
  ]
}